src/toir_cf/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНалогообложенияНДС</name>
  <enumValues>
    <name>НалоговыйАгентПоНДС</name>
  </enumValues>
  <enumValues>
    <name>ПоФактическомуИспользованию</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНаЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНеОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяЕНВД</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортСырьевыхТоваровУслуг</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортНесырьевыхТоваров</name>
  </enumValues>
  <enumValues>
    <name>ВводОСВЭксплуатацию</name>
  </enumValues>
  <enumValues>
    <name>ОпределяетсяРаспределением</name>
  </enumValues>
  <enumValues>
    <name>ОблагаетсяНДСУПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоСДЦ</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеУслуги</name>
  </enumValues>
  <enumValues>
    <name>РеализацияРаботУслугНаЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ПродажаПоПатенту</name>
  </enumValues>
</mdclass:Enum>

src/toir_cf/src/Catalogs/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтавкиНДС</name>
  <comment>Ставки НДС</comment>
  <predefined>
    <items>
      <name>БезНДС</name>
    </items>
  </predefined>
  <attributes>
    <name>ПеречислениеСтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетнаяСтавка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствующаяБазоваяСтавка</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствующаяРасчетнаяСтавка</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТипыНалогообложенияНДС</name>
    <attributes>
      <name>ТипНалогообложенияНДС</name>
      <type>
        <types>EnumRef.ТипыНалогообложенияНДС</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/CommonModules/УчетНДС/Module.bsl
#Область ПрограммныйИнтерфейс

// Заполняет данные выбора ставки НДС
//
// Параметры:
// 	 ДанныеВыбора - СписокЗначений - Данные выбора
// 	 Параметры - Структура - Параметры выбора:
// 	 	* Отбор - Структура - содержит:
// 	 		** Ссылка - ПеречислениеСсылка.ТипыНалогообложенияНДС - 
// 	 СтандартнаяОбработка - Булево - флаг стандартной обработки события
//
Процедура ПолучитьДанныеВыбораСтавкиНДС(ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт 
	
	СтандартнаяОбработка = Ложь;
	
	Запрос = Новый Запрос();
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтавкиНДСТипыНалогообложенияНДС.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(СтавкиНДСТипыНалогообложенияНДС.Ссылка) КАК Представление
	|ИЗ
	|	Справочник.СтавкиНДС.ТипыНалогообложенияНДС КАК СтавкиНДСТипыНалогообложенияНДС
	| ГДЕ
	|	&ОтборПоТипамНалогообложения
	|	И &ОтборПоПараметрам
	|   И &ФильтрПоРассчетнойСтавке
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтавкиНДСТипыНалогообложенияНДС.Ссылка.Представление";
	
	НалогообложениеНДС = Неопределено;
	Если Параметры.Свойство("НалогообложениеНДС", НалогообложениеНДС) Тогда
		Если Не ЗначениеЗаполнено(НалогообложениеНДС) Тогда
			НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		КонецЕсли;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоТипамНалогообложения", "СтавкиНДСТипыНалогообложенияНДС.ТипНалогообложенияНДС В(&ТипыНалогообложения)");
		Запрос.УстановитьПараметр("ТипыНалогообложения", НалогообложениеНДС);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоТипамНалогообложения", "ИСТИНА");
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("Ссылка") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоПараметрам", "СтавкиНДСТипыНалогообложенияНДС.Ссылка В (&ОтборПоСсылке)");
		Запрос.УстановитьПараметр("ОтборПоСсылке", Параметры.Отбор.Ссылка);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоПараметрам", "ИСТИНА");
	КонецЕсли;
	
	Если Параметры.Свойство("ИсключатьДробныеСтавки") И Параметры.ИсключатьДробныеСтавки Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФильтрПоРассчетнойСтавке", "СтавкиНДСТипыНалогообложенияНДС.Ссылка.РасчетнаяСтавка = ЛОЖЬ"); 
	ИначеЕсли Параметры.Свойство("ТолькоДробныеСтавки") И Параметры.ТолькоДробныеСтавки Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФильтрПоРассчетнойСтавке", "СтавкиНДСТипыНалогообложенияНДС.Ссылка.РасчетнаяСтавка = ИСТИНА");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФильтрПоРассчетнойСтавке", "ИСТИНА");
	КонецЕсли; 
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Параметры.СтрокаПоиска)
			ИЛИ СтрНайти(НРег(Выборка.Представление), НРег(Параметры.СтрокаПоиска)) = 1 Тогда
			ДанныеВыбора.Добавить(Выборка.Ссылка, Выборка.Представление);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
